[
  {
     "joke":"What do you call a fake noodle? An impasta."
  },
  {
     "joke":"What did the baby corn say to its mom? Where’s my popcorn?"
  },
  {
     "joke":"Why couldn’t the sesame seed leave the gambling casino? Because he was on a roll."
  },
  {
     "joke":"What does a nosey pepper do? Gets jalapeño business."
  },
  {
     "joke":"What’s orange and sounds like a parrot? A carrot."
  },
  {
     "joke":"When potatoes have babies, what are they called? Tater tots."
  },
  {
     "joke":"How fast is milk? It’s pasteurized before you know it."
  },
  {
     "joke":"How do you make an apple turnover? Push it downhill."
  },
  {
     "joke":"What kind of socks do you need to plant asparagus? Garden hose."
  },
  {
     "joke":"Why did the skeleton go to the barbecue? To get another rib."
  },
  {
     "joke":"What did the pecan say to the walnut? We’re friends because we’re both nuts."
  },
  {
     "joke":"Where did the broccoli go to have a few drinks? The salad bar."
  },
  {
     "joke":"What did one blueberry say to the other blueberry? If you weren’t so sweet, we wouldn’t be in this jam."
  },
  {
     "joke":"What do you call cheese that is not ours? Nacho cheese."
  },
  {
     "joke":"Wanna hear a joke about pizza? Never mind, it’s too cheesy."
  },
  {
     "joke":"What’s the best way to burn vegetables? Roast them."
  },
  {
     "joke":"Which condiment adds the most kick? Horseradish."
  },
  {
     "joke":"Why are butchers so hilarious? They always ham it up."
  },
  {
     "joke":"Which friends should you take to dinner? Your taste buds."
  },
  {
     "joke":"What should you do if your soup is too hot? Add a chilly pepper."
  },
  {
     "joke":"What part of a meal makes you the most sleepy? A nap-kin."
  },
  {
     "joke":"What’s an omnivore’s favorite food? Zoo-chini."
  },
  {
     "joke":"When is eating just like school? When you have three or four courses."
  },
  {
     "joke":"Why did the butcher work extra hours at the shop? To make ends meat."
  },
  {
     "joke":"What do you call blueberries playing the guitar? A jam session."
  },
  {
     "joke":"What’s the most relaxing type of pasta? Spa-ghetti."
  },
  {
     "joke":"How do you truly savor a hot dog? With relish."
  },
  {
     "joke":"How do you ask a foodie out to dinner? “Lettuce meat for a date.”"
  },
  {
     "joke":"What’s the best thing to put into a pie? Your teeth!"
  },
  {
     "joke":"When do you go at red and stop at green? When you’re eating a watermelon."
  },
  {
     "joke":"Did you hear the joke about the peanut butter? I’m not telling you. You might spread it!"
  },
  {
     "joke":"Why do the French like to eat snails? Because they don’t like fast food."
  },
  {
     "joke":"What kind of nuts always seem to have a cold? Cashews!"
  },
  {
     "joke":"Why did the banana go to the doctor? I wasn’t peeling well."
  },
  {
     "joke":"In which school do you learn how to make ice cream? Sunday School"
  },
  {
     "joke":"Why shouldn’t you tell a secret on a farm? Because the potatoes have eyes and the corn have ears."
  },
  {
     "joke":"Did you hear about the carrot detective? He got to the root of every case."
  },
  {
     "joke":"Why does yogurt love going to museums? Because it’s cultured."
  },
  {
     "joke":"How do you measure the weight of crackers? In grahams."
  },
  {
     "joke":"Boy, I just got hit in the head with a soda. I was lucky it was a soft drink."
  },
  {
     "joke":"What do you give to a sick lemon? Lemon-aid."
  },
  {
     "joke":"What are twins favorite fruit? Pears!"
  },
  {
     "joke":"Why did the dieter go to the paint store? He wanted to get thinner."
  },
  {
     "joke":"Why do melons prefer weddings? They cantaloupe!"
  },
  {
     "joke":"What do you get when you put three ducks in a box? A box of quackers!"
  },
  {
     "joke":"What happened to the slices of bread that disappeared overnight? Turned out the e-loafed!"
  },
  {
     "joke":"What did the Ketchup say to the hot dog? Nice to meat you!"
  },
  {
     "joke":"Why couldn’t the hamburger stop making jokes? He was on a roll!"
  },
  {
     "joke":"Why didn’t the gardener get around to planting an herb garden? They couldn’t find the thyme!"
  },
  {
     "joke":"What did the pizza say to chef say to his significant other? This might sound cheesy, but you’ve got a pizza my heart"
  },
  {
     "joke":"Why did the student eat her exam? The teacher told her it was a piece of cake!"
  },
  {
     "joke":"Why was the cookie crying? Because his mom was a wafer so long."
  },
  {
     "joke":"What do you call a pea who woke up on the wrong side of the bed? Grum-pea"
  },
  {
     "joke":"What did the grape say when he was squished? He let out a little wine."
  }
]